{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "data_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___9", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___10", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "avg_pool2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_avg_pool2d_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "avg_pool2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_avg_pool2d_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu5_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_3", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu5_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_prelu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu7_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu5_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_flatten", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_broadcast_mul_broadcast_add", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    8, 
    9, 
    10, 
    13, 
    14, 
    16, 
    19, 
    20, 
    21, 
    24, 
    25, 
    27, 
    30, 
    31, 
    32, 
    35, 
    36, 
    38, 
    40, 
    41, 
    42, 
    45, 
    46, 
    48, 
    50, 
    51, 
    52, 
    53
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55
  ], 
  "heads": [[54, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        5, 
        0, 
        6, 
        7, 
        1, 
        8, 
        2, 
        1, 
        9, 
        10, 
        11, 
        2, 
        1, 
        12, 
        13, 
        2, 
        14, 
        1, 
        2, 
        15, 
        16, 
        17, 
        0, 
        3, 
        18, 
        19, 
        1, 
        20, 
        2, 
        0, 
        21, 
        22, 
        23, 
        3, 
        0, 
        24, 
        25, 
        3, 
        26, 
        0, 
        27, 
        28, 
        29, 
        3, 
        0, 
        30, 
        31, 
        3, 
        32, 
        0, 
        33, 
        34, 
        35, 
        36, 
        4]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 48, 48], 
        [1, 1, 48, 48, 3], 
        [8, 1, 3, 3, 3, 8], 
        [8, 8], 
        [1, 8, 46, 46, 8], 
        [64], 
        [1, 64, 46, 46], 
        [1, 64, 23, 23], 
        [64, 1, 3, 3], 
        [64], 
        [64], 
        [1, 64, 21, 21], 
        [1, 8, 21, 21, 8], 
        [16, 8, 1, 1, 8, 8], 
        [16, 8], 
        [1, 16, 21, 21, 8], 
        [128], 
        [1, 128, 21, 21], 
        [1, 128, 10, 10], 
        [128, 1, 3, 3], 
        [128], 
        [128], 
        [1, 128, 8, 8], 
        [1, 16, 8, 8, 8], 
        [32, 16, 1, 1, 8, 8], 
        [32, 8], 
        [1, 32, 8, 8, 8], 
        [256], 
        [1, 256, 8, 8], 
        [1, 256, 4, 4], 
        [256, 1, 2, 2], 
        [256], 
        [256], 
        [1, 256, 3, 3], 
        [1, 32, 3, 3, 8], 
        [64, 32, 1, 1, 8, 8], 
        [64, 8], 
        [1, 64, 3, 3, 8], 
        [512], 
        [1, 512, 3, 3], 
        [512, 1, 3, 3], 
        [512], 
        [512], 
        [1, 512, 1, 1], 
        [1, 64, 1, 1, 8], 
        [64, 64, 1, 1, 8, 8], 
        [64, 8], 
        [1, 64, 1, 1, 8], 
        [512], 
        [1, 512], 
        [212, 512], 
        [212], 
        [212], 
        [212], 
        [1, 212]]]
  }
}