{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "data_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu2_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu1_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu3_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu3_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu4_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu5_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu5_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu7_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___16", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_4", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu5_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu6_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_4", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu9_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___17", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_5", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu6_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_5", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu7_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_5", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu11_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___18", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_6", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu7_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_6", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu8_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_6", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu13_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___19", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm14_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_7", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu8_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu9_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_7", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu15_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___20", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm16_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_8", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu9_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_8", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu10_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_8", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu17_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___21", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm18_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_9", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu10_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_9", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_weight_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_bias_sc", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prelu11_dw_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_add_prelu_9", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "prelu19_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___22", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_weight_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_bias_C8c", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm20_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_10", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu11_sep_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___prelu_flatten", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_3_bias", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm21_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_broadcast_mul_broadcast_add", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 0], [142, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    5, 
    7, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    18, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    30, 
    31, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41, 
    42, 
    43, 
    44, 
    46, 
    48, 
    49, 
    50, 
    51, 
    54, 
    55, 
    56, 
    57, 
    59, 
    61, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    72, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    82, 
    83, 
    85, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94, 
    95, 
    96, 
    98, 
    100, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    109, 
    111, 
    113, 
    114, 
    115, 
    116, 
    119, 
    120, 
    121, 
    122, 
    124, 
    126, 
    127, 
    128, 
    129, 
    132, 
    133, 
    134, 
    135, 
    137, 
    139, 
    140, 
    141, 
    142
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144
  ], 
  "heads": [[143, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        0, 
        7, 
        8, 
        9, 
        10, 
        1, 
        11, 
        0, 
        12, 
        13, 
        14, 
        15, 
        1, 
        0, 
        16, 
        17, 
        18, 
        19, 
        1, 
        20, 
        0, 
        21, 
        22, 
        23, 
        24, 
        1, 
        0, 
        25, 
        26, 
        27, 
        28, 
        1, 
        29, 
        0, 
        30, 
        31, 
        32, 
        33, 
        1, 
        0, 
        34, 
        35, 
        36, 
        37, 
        1, 
        38, 
        0, 
        39, 
        40, 
        41, 
        42, 
        1, 
        0, 
        43, 
        44, 
        45, 
        46, 
        1, 
        47, 
        0, 
        48, 
        49, 
        50, 
        51, 
        1, 
        0, 
        52, 
        53, 
        54, 
        55, 
        1, 
        56, 
        0, 
        57, 
        58, 
        59, 
        60, 
        2, 
        3, 
        61, 
        62, 
        63, 
        64, 
        2, 
        65, 
        3, 
        66, 
        67, 
        68, 
        69, 
        2, 
        3, 
        70, 
        71, 
        72, 
        73, 
        2, 
        74, 
        3, 
        75, 
        76, 
        77, 
        78, 
        2, 
        3, 
        79, 
        80, 
        81, 
        82, 
        2, 
        83, 
        3, 
        84, 
        85, 
        86, 
        87, 
        2, 
        3, 
        88, 
        89, 
        90, 
        91, 
        2, 
        92, 
        3, 
        93, 
        94, 
        95, 
        96, 
        4, 
        5, 
        97, 
        98, 
        99, 
        100, 
        4, 
        101, 
        5, 
        102, 
        103, 
        104, 
        105, 
        4]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "shape": ["list_shape", [
        [1, 3, 96, 96], 
        [1, 1, 96, 96, 3], 
        [4, 1, 3, 3, 3, 8], 
        [4, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 94, 94, 8], 
        [32], 
        [1, 32, 94, 94], 
        [32, 1, 2, 2], 
        [32], 
        [32, 1, 1], 
        [32], 
        [1, 32, 93, 93], 
        [1, 4, 93, 93, 8], 
        [4, 4, 1, 1, 8, 8], 
        [4, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 93, 93, 8], 
        [32], 
        [1, 32, 93, 93], 
        [32, 1, 3, 3], 
        [32], 
        [32, 1, 1], 
        [32], 
        [1, 32, 46, 46], 
        [1, 4, 46, 46, 8], 
        [8, 4, 1, 1, 8, 8], 
        [8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 46, 46, 8], 
        [64], 
        [1, 64, 46, 46], 
        [64, 1, 2, 2], 
        [64], 
        [64, 1, 1], 
        [64], 
        [1, 64, 45, 45], 
        [1, 8, 45, 45, 8], 
        [8, 8, 1, 1, 8, 8], 
        [8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 45, 45, 8], 
        [64], 
        [1, 64, 45, 45], 
        [64, 1, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64], 
        [1, 64, 22, 22], 
        [1, 8, 22, 22, 8], 
        [8, 8, 1, 1, 8, 8], 
        [8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 22, 22, 8], 
        [64], 
        [1, 64, 22, 22], 
        [64, 1, 2, 2], 
        [64], 
        [64, 1, 1], 
        [64], 
        [1, 64, 21, 21], 
        [1, 8, 21, 21, 8], 
        [8, 8, 1, 1, 8, 8], 
        [8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 21, 21, 8], 
        [64], 
        [1, 64, 21, 21], 
        [64, 1, 3, 3], 
        [64], 
        [64, 1, 1], 
        [64], 
        [1, 64, 10, 10], 
        [1, 8, 10, 10, 8], 
        [16, 8, 1, 1, 8, 8], 
        [16, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 10, 10, 8], 
        [128], 
        [1, 128, 10, 10], 
        [128, 1, 2, 2], 
        [128], 
        [128, 1, 1], 
        [128], 
        [1, 128, 9, 9], 
        [1, 16, 9, 9, 8], 
        [16, 16, 1, 1, 8, 8], 
        [16, 8], 
        [16, 1, 1, 8], 
        [16, 1, 1, 8], 
        [1, 16, 9, 9, 8], 
        [128], 
        [1, 128, 9, 9], 
        [128, 1, 3, 3], 
        [128], 
        [128, 1, 1], 
        [128], 
        [1, 128, 4, 4], 
        [1, 16, 4, 4, 8], 
        [32, 16, 1, 1, 8, 8], 
        [32, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 4, 4, 8], 
        [256], 
        [1, 256, 4, 4], 
        [256, 1, 2, 2], 
        [256], 
        [256, 1, 1], 
        [256], 
        [1, 256, 3, 3], 
        [1, 32, 3, 3, 8], 
        [32, 32, 1, 1, 8, 8], 
        [32, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 3, 3, 8], 
        [256], 
        [1, 256, 3, 3], 
        [256, 1, 3, 3], 
        [256], 
        [256, 1, 1], 
        [256], 
        [1, 256, 1, 1], 
        [1, 32, 1, 1, 8], 
        [32, 32, 1, 1, 8, 8], 
        [32, 8], 
        [32, 1, 1, 8], 
        [32, 1, 1, 8], 
        [1, 32, 1, 1, 8], 
        [256], 
        [1, 256], 
        [212, 256], 
        [212], 
        [212], 
        [212], 
        [1, 212]]]
  }
}